c5/src/Documents/InvoiceRecord/InvoiceRecord.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>InvoiceRecord</name>
  <basedOn>Document.Invoice</basedOn>
  <basedOn>Document.Transfer</basedOn>
  <basedOn>Document.LVITransfer</basedOn>
  <basedOn>Document.VendorReturn</basedOn>
  <basedOn>Document.Sale</basedOn>
  <basedOn>Document.WriteOff</basedOn>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.RangeStatuses</registerRecords>
  <attributes>
    <name>Account</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>AttachedDocuments</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>AttachmentRows</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Base</name>
    <type>
      <types>DefinedType.InvoiceRecordBase</types>
    </type>
  </attributes>
  <attributes>
    <name>Carrier</name>
    <type>
      <types>CatalogRef.Organizations</types>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>CatalogRef.Organizations</types>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Delegated</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DeliveryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Description</name>
    <type>
      <types>DefinedType.SaleDescription</types>
    </type>
  </attributes>
  <attributes>
    <name>Dispatcher</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Driver</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Factor</name>
    <type>
      <types>DefinedType.Factor</types>
    </type>
  </attributes>
  <attributes>
    <name>FirstPageRows</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FormNumber</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LoadingAddress</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>LoadingPoint</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PowerAttorneyDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PowerAttorneyNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PowerAttorneySeries</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Prices</name>
    <type>
      <types>CatalogRef.Prices</types>
    </type>
  </attributes>
  <attributes>
    <name>PrintBack</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Range</name>
    <type>
      <types>CatalogRef.Ranges</types>
    </type>
  </attributes>
  <attributes>
    <name>Rate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>Redirects</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Series</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ShowServices</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.FormStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>Storekeeper</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Transfer</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.Print</types>
    </type>
  </attributes>
  <attributes>
    <name>UnloadingAddress</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>UnloadingPoint</name>
    <type>
      <types>CatalogRef.Organizations</types>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>VAT</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>VATUse</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WaybillDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WaybillNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WaybillSeries</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Discounts</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Detail</name>
      <type>
        <types>DocumentRef.Payment</types>
        <types>DocumentRef.Invoice</types>
        <types>DocumentRef.Refund</types>
      </type>
    </attributes>
    <attributes>
      <name>Document</name>
      <type>
        <types>DocumentRef.Invoice</types>
        <types>DocumentRef.Bill</types>
        <types>DocumentRef.SalesOrder</types>
        <types>DocumentRef.Refund</types>
        <types>DocumentRef.Debts</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Capacity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>ExtraCharge</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.FixedAssets</types>
        <types>CatalogRef.Items</types>
        <types>CatalogRef.IntangibleAssets</types>
      </type>
    </attributes>
    <attributes>
      <name>OtherInfo</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
    <attributes>
      <name>ProducerPrice</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Series</name>
      <type>
        <types>CatalogRef.Series</types>
      </type>
    </attributes>
    <attributes>
      <name>Social</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Services</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>OtherInfo</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/Enums/Print/Print.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Print</name>
  <enumValues>
    <name>ElectronicLandscape</name>
  </enumValues>
  <enumValues>
    <name>ElectronicPortrait</name>
  </enumValues>
  <enumValues>
    <name>Landscape</name>
  </enumValues>
  <enumValues>
    <name>Portrait</name>
  </enumValues>
</mdclass:Enum>

c5/src/Enums/VAT/VAT.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>VAT</name>
  <enumValues>
    <name>Standart</name>
  </enumValues>
  <enumValues>
    <name>Reduced</name>
  </enumValues>
  <enumValues>
    <name>Zero</name>
  </enumValues>
  <enumValues>
    <name>None</name>
  </enumValues>
</mdclass:Enum>

c5/src/Catalogs/Contacts/Contacts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Contacts</name>
  <basedOn>Catalog.Leads</basedOn>
  <owners>Catalog.Companies</owners>
  <owners>Catalog.Organizations</owners>
  <owners>Catalog.Warehouses</owners>
  <owners>Catalog.Leads</owners>
  <attributes>
    <name>AdditionalPhone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>Birthday</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BusinessPhone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>Contact</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ContactType</name>
    <type>
      <types>CatalogRef.ContactTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Date</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>DefinedType.Email</types>
    </type>
  </attributes>
  <attributes>
    <name>Fax</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>FirstName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Gender</name>
    <type>
      <types>EnumRef.Sex</types>
    </type>
  </attributes>
  <attributes>
    <name>HomePhone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>LastName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Lead</name>
    <type>
      <types>CatalogRef.Leads</types>
    </type>
  </attributes>
  <attributes>
    <name>MobilePhone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>Name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Patronymic</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Salutation</name>
    <type>
      <types>CatalogRef.Salutations</types>
    </type>
  </attributes>
  <attributes>
    <name>Skype</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Twitter</name>
    <type>
      <types>DefinedType.Twitter</types>
    </type>
  </attributes>
  <attributes>
    <name>Web</name>
    <type>
      <types>DefinedType.Web</types>
    </type>
  </attributes>
</mdclass:Catalog>

c5/src/Documents/InvoiceRecord/ManagerModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Procedure PresentationFieldsGetProcessing(Fields, StandardProcessing)
	
	DocumentPresentation.StandardFields(Fields, StandardProcessing);
	
EndProcedure

Procedure PresentationGetProcessing(Data, Presentation, StandardProcessing)
	
	DocumentPresentation.StandardPresentation(Metadata.Documents.InvoiceRecord.Synonym, Data, Presentation, StandardProcessing);
	
EndProcedure

#region Printing

Function Print(Params, Env) export
	
	Print.SetFooter(Params.TabDoc);
	getData(Params, Env);
	if (not FormsPrint.Check(Params.Reference, Env.Fields.Status)) then
		return false;
	endif;
	setTemplates(Env);
	setPageSettings(Params, Env);
	putHeader(Params, Env);
	putRow(Params, Env, Env.First);
	putFooter(Params, Env);
	putAttachments(Params, Env);
	putBack(Params, Env);
	return true;
	
EndFunction

Procedure getData(Params, Env)
	
	sqlFields(Env);
	getFields(Params, Env);
	defineAmount(Env);
	sqlItems(Env);
	getTables(Env);
	distributeItems(Env);
	Env.Insert("IsAttachment", false);
	
EndProcedure

Procedure sqlFields(Env)
	
	s = "
		|// @Fields
		|select top 1 Documents.Number as Number, Documents.Company.FullDescription as Company,
		|	Documents.Company.CodeFiscal as CodeFiscal, Documents.Status as Status,
		|	case when Documents.Type = value ( Enum.Print.Portrait ) then true else false end as Portrait,
		|	case when Documents.Type = value ( Enum.Print.ElectronicPortrait ) then true else false end as ElectronicPortrait,
		|	case when Documents.Type = value ( Enum.Print.ElectronicLandscape ) then true else false end as ElectronicLandscape,
		|	case when Documents.Type = value ( Enum.Print.Landscape ) then true else false end as Landscape,
		|	isnull ( Documents.Account.AccountNumber, """" ) as Account, Documents.AttachedDocuments as AttachedDocuments, 
		|	isnull ( Documents.Carrier.FullDescription, """" ) as Carrier, Documents.Currency as Currency, Constants.Currency as LocalCurrency,
		|	cast ( Documents.Base as Document.Invoice ).Contract.Currency as ContractCurrency,
		|	Documents.Delegated as Delegated, isnull ( Documents.Dispatcher.Description, """" ) as Dispatcher, 
		|	isnull ( Documents.Driver.Description, """" ) as Driver, Documents.Factor as Factor, Documents.FirstPageRows as FirstPageRows, 
		|	isnull ( Documents.LoadingAddress.Presentation, """" ) as LoadingAddress, Documents.AttachmentRows as AttachmentRows,
		|	Documents.PowerAttorneyDate as PowerAttorneyDate, Documents.PowerAttorneyNumber as PowerAttorneyNumber, 
		|	Documents.PowerAttorneySeries as PowerAttorneySeries, Documents.Rate as Rate, isnull ( Documents.Customer.FullDescription, """" ) as Customer,
		|	isnull ( Documents.CustomerAccount.AccountNumber, """" ) as CustomerAccount, Documents.Redirects as Redirects,
		|	isnull ( Documents.Storekeeper.Description, """" ) as Storekeeper, isnull ( Documents.Customer.VATCode, """" ) as CustomerVATCode,
		|	isnull ( Documents.UnloadingAddress.Presentation, """" ) as UnloadingAddress, 	Documents.WaybillDate as WaybillDate, 
		|	Documents.WaybillNumber as WaybillNumber, Documents.WaybillSeries as WaybillSeries,
		|	isnull ( Documents.Account.Bank.Description, """" ) as Bank, isnull ( Documents.Company.PaymentAddress.Presentation, """" ) as CompanyAddress, 
		|	Contacts.BusinessPhone as BusinessPhone, ContactsCustomer.BusinessPhone as CustomerBusinessPhone,
		|	isnull ( Documents.Customer.PaymentAddress.Presentation, """" ) as CustomerAddress, Documents.Date as Date,
		|	isnull ( Documents.CustomerAccount.Bank.Description, """" ) as CustomerBank, isnull ( Documents.Customer.CodeFiscal, """" ) as CustomerCodeFiscal,
		|	isnull ( Documents.CustomerAccount.Bank.Code, """" ) as CustomerBankCode, isnull ( Documents.Account.Bank.Code, """" ) as BankCode,
		|	Documents.DeliveryDate as DeliveryDate, isnull ( Documents.Carrier.CodeFiscal, """" ) as CarrierCodeFiscal,
		|	isnull ( Documents.Carrier.VATCode, """" ) as CarrierVATCode, isnull ( Documents.Company.VATCode, """" ) as VATCode,
		|	isnull ( PersonnelDispatcher.Position.Description, """" ) as DispatcherPosition, isnull ( PersonnelDriver.Position.Description, """" ) as DriverPosition,
		|	isnull ( PersonnelStorekeeper.Position.Description, """" ) as StorekeeperPosition, Documents.PrintBack as PrintBack,
		|	case when Logos.Logo is null then false else true end as LogoLoaded,  Logos.Logo as Logo
		|from Document.InvoiceRecord as Documents
		|	//
		|	// Constants
		|	//
		|	join Constants as Constants
		|	on true
		|	//
		|	// Contacts
		|	//
		|	left join Catalog.Contacts as Contacts
		|	on Contacts.Owner = Documents.Company
		|	and not Contacts.DeletionMark
		|	and Contacts.ContactType = value ( Catalog.ContactTypes.Director )
		|	//
		|	// Contacts Customer
		|	//
		|	left join Catalog.Contacts as ContactsCustomer
		|	on ContactsCustomer.Owner = Documents.Customer
		|	and not ContactsCustomer.DeletionMark
		|	and ContactsCustomer.ContactType = value ( Catalog.ContactTypes.Director )
		|	//
		|	// Personnel Dispatcher
		|	//
		|	left join InformationRegister.Personnel as PersonnelDispatcher
		|	on PersonnelDispatcher.Employee = Documents.Dispatcher
		|	and Documents.Dispatcher <> value ( Catalog.Employees.EmptyRef )
		|	//
		|	// Personnel Driver
		|	//
		|	left join InformationRegister.Personnel as PersonnelDriver
		|	on PersonnelDriver.Employee = Documents.Driver
		|	and Documents.Driver <> value ( Catalog.Employees.EmptyRef )
		|	//
		|	// Personnel Storekeeper
		|	//
		|	left join InformationRegister.Personnel as PersonnelStorekeeper
		|	on PersonnelStorekeeper.Employee = Documents.Storekeeper
		|	and Documents.Storekeeper <> value ( Catalog.Employees.EmptyRef )
		|	//
		|	// Logos
		|	//
		|	left join InformationRegister.Logos as Logos
		|	on Logos.Company = Documents.Company
		|where Documents.Ref = &Ref 
		|";
	Env.Selection.Add(s);
	
EndProcedure

Procedure getFields(Params, Env)
	
	Env.Q.SetParameter("Ref", Params.Reference);
	SQL.Perform(Env);
	
EndProcedure

Procedure defineAmount(Env)
	
	list = new Structure();
	Env.Insert("AmountFields", list);
	fields = Env.Fields;
	foreign = fields.Currency <> fields.LocalCurrency;
	total = "Total";
	vat = "VAT";
	producerPrice = "ProducerPrice";
	if (foreign) then
		rate = " * &Rate / &Factor";
		total = total + rate;
		vat = vat + rate;
		producerPrice = producerPrice + rate;
	endif;
	list.Insert("Total", "cast ( " + total + " as Number ( 15, 2 ) )");
	list.Insert("VAT", "cast ( " + vat + " as Number ( 15, 2 ) )");
	list.Insert("ProducerPrice", "cast ( " + producerPrice + " as Number ( 15, 2 ) )");
	
EndProcedure

Procedure sqlItems(Env)
	
	amountFields = Env.AmountFields;
	total = amountFields.Total;
	vat = amountFields.VAT;
	amount = total + " - " + vat;
	producerPrice = amountFields.ProducerPrice;
	s = "
	|// #Items
	|select case when Items.Item refs Catalog.Items and Items.Item.CountPackages then Items.Capacity else """" end as Capacity,
	|	presentation ( case when Items.Package = value ( Catalog.Packages.EmptyRef ) then Items.Item.Unit else Items.Package end ) as Unit,
	|	Items.QuantityPkg as Quantity,
	|	case when Items.Item refs Catalog.Items then
	|		( case when Items.Item.CountPackages then Items.QuantityPkg else Items.Quantity end * Items.Item.Weight ) / 1000
	|		when Items.Item refs Catalog.FixedAssets then ( Items.Quantity * Items.Item.Weight ) / 1000
	|		else 0
	|	end as Weight, " + total + " as Total, " + vat + " as VAT, 
	|	case 
	|		when case when Items.Item refs Catalog.Items then Items.QuantityPkg else Items.Quantity end = 0 then " + amount + "
	|		else (" + amount + ") / case when Items.Item refs Catalog.Items then Items.QuantityPkg else Items.Quantity end 
	|	end as Price, " + amount + " as Amount, 
	|	isnull ( Items.Feature.Description, """" ) as Feature, isnull ( Items.Series.Description, """" ) as Series,
	|	isnull ( Items.Item.FullDescription, """" ) as Item, Items.VATCode.Type = value ( Enum.VAT.None ) as NoVAT,
	|	Items.VATRate as VATRate, false as Empty, Items.OtherInfo as OtherInfo,
	|	Items.Social as Social, " + producerPrice + " as ProducerPrice, Items.ExtraCharge as ExtraCharge,
	|	isnull ( Items.Item.SKU, """" ) as SKU
	|from Document.InvoiceRecord.Items as Items
	|where Items.Ref = &Ref 
	|union all
	|select """", Services.Item.Unit.Code, Services.Quantity, 0, " + total + ", " + vat + ", 
	|	case when Services.Quantity = 0 then " + amount + " else (" + amount + ") /  Services.Quantity end, 
	|	" + amount + ", isnull ( Services.Feature.Description, """" ), """", Services.Description,
	|	Services.VATCode.Type = value ( Enum.VAT.None ), Services.VATRate, false, Services.OtherInfo,
	|	false, 0, 0, """"
	|from Document.InvoiceRecord.Services as Services
	|where Services.Ref = &Ref 
	|union all
	|select """", """", 0, 0, - Discounts.Amount * &Rate / &Factor, - Discounts.VAT * &Rate / &Factor, 0, 
	|	- ( Discounts.Amount - Discounts.VAT ) * &Rate / &Factor, """", """", Discounts.Item.FullDescription,
	|	Discounts.VATCode.Type = value ( Enum.VAT.None ), Discounts.VATRate, false, """", false, 0, 0, """"
	|from Document.InvoiceRecord.Discounts as Discounts
	|where Discounts.Ref = &Ref 
	|";
	Env.Selection.Add(s);
	
EndProcedure

Procedure getTables(Env)
	
	q = Env.Q;
	fields = Env.Fields;
	q.SetParameter("Rate", fields.Rate);
	q.SetParameter("Factor", fields.Factor);
	SQL.Perform(Env);
	
EndProcedure

Procedure distributeItems(Env)
	
	items = Env.Items;
	first = items.CopyColumns();
	tables = new Array();
	fields = Env.Fields;
	firstPageRows = fields.FirstPageRows;
	attachmentRows = fields.AttachmentRows;
	rows = 0;
	for each row in items do
		if (firstPageRows > 0) then
			FillPropertyValues(first.Add(), row);
		else
			if (rows = 0) then
				rows = attachmentRows;
				attachment = items.CopyColumns();
				tables.Add(attachment);
			endif;
			FillPropertyValues(attachment.Add(), row);
			rows = rows - 1;
		endif;
		firstPageRows = firstPageRows - 1;
	enddo;
	addEmptyRows(first, fields.FirstPageRows - first.Count());
	count = tables.Count();
	if (count > 0) then
		last = tables[count - 1];
		addEmptyRows(last, fields.AttachmentRows - last.Count());
	endif;
	Env.Insert("First", first);
	Env.Insert("Attachments", tables);
	
EndProcedure

Procedure addEmptyRows(Table, Difference)
	
	while (Difference > 0) do
		row = Table.Add();
		row.Empty = true;
		Difference = Difference - 1;
	enddo;
	
EndProcedure

Procedure setTemplates(Env)
	
	fields = Env.Fields;
	if (fields.Portrait) then
		invoice = "Invoice";
		attachment = "Attachment";
	elsif (fields.Landscape) then
		invoice = "InvoiceLandscape";
		attachment = "AttachmentLandscape";
	elsif (fields.ElectronicPortrait) then
		invoice = "InvoiceElectronic";
		attachment = "AttachmentElectronic";
	else
		invoice = "InvoiceElectronicLandscape";
		attachment = "AttachmentElectronicLandscape";
	endif;
	manager = Documents.InvoiceRecord;
	Env.T = manager.GetTemplate(invoice);
	Env.Insert("Attachment", manager.GetTemplate(attachment));
	Env.Insert("Back", manager.GetTemplate("Back"));
	
EndProcedure

Procedure setPageSettings(Params, Env)
	
	tabDoc = Params.TabDoc;
	fields = Env.Fields;
	if (fields.Portrait
			or fields.ElectronicPortrait) then
		tabDoc.PageOrientation = PageOrientation.Portrait;
	else
		tabDoc.PageOrientation = PageOrientation.Landscape;
	endif;
	tabDoc.FitToPage = true;
	
EndProcedure

Procedure putHeader(Params, Env)
	
	area = Env.T.GetArea("Header");
	p = area.Parameters;
	fields = Env.Fields;
	contractCurrency = fields.ContractCurrency;
	if ( contractCurrency <> null
		and contractCurrency <> fields.LocalCurrency ) then
		p.Currency = Print.CurrencyInfo ( contractCurrency, fields.Rate, fields.Factor );
	endif;
	p.WaybillSeries = TrimAll(fields.WaybillSeries);
	p.WaybillNumber = TrimAll(fields.WaybillNumber);
	p.WaybillDate = fields.WaybillDate;
	p.Date = fields.Date;
	p.DeliveryDate = fields.DeliveryDate;
	p.Company = getCompany(fields);
	p.Customer = getCustomer(fields);
	if (fields.ElectronicPortrait
			or fields.ElectronicLandscape) then
		number = TrimAll(fields.Number);
		p.Number = number;
		setBarcode(area, number);
		setLogo(area, fields);
	endif;
	p.AttachedDocuments = TrimAll(fields.AttachedDocuments);
	p.CodeFiscal = TrimAll(fields.CodeFiscal);
	p.VATCode = TrimAll(fields.VATCode);
	p.CustomerCodeFiscal = fields.CustomerCodeFiscal;
	p.CustomerVATCode = TrimAll(fields.CustomerVATCode);
	p.CarrierCodeFiscal = fields.CarrierCodeFiscal;
	p.CarrierVATCode = TrimAll(fields.CarrierVATCode);
	p.LoadingAddress = TrimAll(fields.LoadingAddress);
	p.UnloadingAddress = TrimAll(fields.UnloadingAddress);
	p.Redirects = TrimAll(fields.Redirects);
	p.Carrier = TrimAll(fields.Carrier);
	p.PowerAttorneySeries = TrimAll(fields.PowerAttorneySeries);
	p.PowerAttorneyNumber = fields.PowerAttorneyNumber;
	p.PowerAttorneyDate = fields.PowerAttorneyDate;
	p.Delegated = fields.Delegated;
	Params.TabDoc.Put(area);
	
EndProcedure

Function getCompany(Fields)
	
	company = TrimAll(Fields.Company);
	addValue(company, Fields.CompanyAddress);
	addPhone(company, Fields.BusinessPhone);
	addValue(company, bank(Fields.Bank, Fields.BankCode, Fields.Account), ". ");
	return company;
	
EndFunction

Procedure addValue(Field, Value, Separator = ", ")
	
	Value = TrimAll(Value);
	if (not IsBlankString(Value)) then
		Field = Field + Separator + Value;
	endif;
	
EndProcedure

Procedure addPhone(Field, Phone)
	
	Phone = TrimAll(Phone);
	if (not IsBlankString(Phone)) then
		Field = Field + ", tel.: " + Phone;
	endif;
	
EndProcedure

Function bank(Bank, BankCode, Account)
	
	field = Bank;
	BankCode = TrimAll(BankCode);
	if (not IsBlankString(BankCode)) then
		field = field + ", C/B: " + BankCode;
	endif;
	addValue(field, Account);
	return field;
	
EndFunction

Function getCustomer(Fields)
	
	customer = TrimAll(Fields.Customer);
	addValue(customer, Fields.CustomerAddress);
	addPhone(customer, Fields.CustomerBusinessPhone);
	addValue(customer, bank(Fields.CustomerBank, Fields.CustomerBankCode, Fields.CustomerAccount), ". ");
	return customer;
	
EndFunction

Procedure setBarcode(Area, Barcode)
	
	picture = Area.Drawings.Barcode;
	p = PrintBarcodes.GetParams();
	p.Width = picture.Width;
	p.Height = picture.Height;
	p.Barcode = Barcode;
	p.Type = 4;
	Area.Drawings.Barcode.Picture = PrintBarcodes.GetPicture(p);
	
EndProcedure

Procedure setLogo(Area, Fields)
	
	if (Fields.LogoLoaded) then
		Area.Drawings.Logo.Picture = new Picture(Fields.Logo.Get());
	endif;
	
EndProcedure

Procedure putRow(Params, Env, Table)
	
	if (Env.IsAttachment) then
		t = Env.Attachment;
	else
		t = Env.T;
	endif;
	area = t.GetArea("Row");
	emptyRow = t.GetArea("EmptyRow");
	p = area.Parameters;
	tabDoc = Params.TabDoc;
	noVAT = Output.NoVAT ();
	for each row in Table do
		if (row.Empty) then
			tabDoc.Put(emptyRow);
			continue;
		endif;
		p.Fill(row);
		p.ItemPresentation = Conversion.ValuesToString (
			row.SKU, row.Item, row.Feature, ? ( row.Series = "", "", "#" + row.Series )
		);
		if (row.Social) then
			p.OtherInfo = "" + row.ProducerPrice + "/" + Format(row.ExtraCharge, "NFD=2; NZ=") + " " + row.OtherInfo;
		endif;
		if ( row.NoVAT ) then
			p.VATRate = noVAT;
		else
			p.VATRate = Format ( row.VATRate, "NZ=0" ) + "%";
		endif;
		tabDoc.Put(area);
	enddo;
	
EndProcedure

Procedure putFooter(Params, Env)
	
	area = Env.T.GetArea("Footer");
	p = area.Parameters;
	fields = Env.Fields;
	items = Env.Items;
	p.TotalTotal = items.Total("Total");
	p.TotalAmount = items.Total("Amount");
	p.TotalVAT = items.Total("VAT");
	p.TotalWeight = items.Total("Weight");
	p.Dispatcher = employee(fields.Dispatcher, fields.DispatcherPosition);
	p.Storekeeper = employee(fields.Storekeeper, fields.StorekeeperPosition);
	p.Driver = employee(fields.Driver, fields.DriverPosition);
	p.Delegated = fields.Delegated;
	table = Env.First;
	p.Amount = table.Total("Amount");
	p.Total = table.Total("Total");
	p.VAT = table.Total("VAT");
	p.Weight = table.Total("Weight");
	tabDoc = Params.TabDoc;
	tabDoc.Put(area);
	tabDoc.PutHorizontalPageBreak();
	
EndProcedure

Function employee(Employee, Position)
	
	return TrimAll(Employee + ?(IsBlankString(Position), "", " - " + Position));
	
EndFunction

Procedure putAttachments(Params, Env)
	
	Env.IsAttachment = true;
	for each table in Env.Attachments do
		putHeaderAttachment(Params, Env);
		putRow(Params, Env, table);
		putFooterAttachment(Params, Env, table);
	enddo;
	
EndProcedure

Procedure putHeaderAttachment(Params, Env)
	
	area = Env.Attachment.GetArea("Header");
	p = area.Parameters;
	fields = Env.Fields;
	p.CodeFiscal = TrimAll(fields.CodeFiscal);
	number = TrimAll(fields.Number);
	p.Number = number;
	p.Date = fields.Date;
	p.VATCode = fields.VATCode;
	if (fields.ElectronicPortrait
			or fields.ElectronicLandscape) then
		setLogo(area, fields);
	endif;
	Params.TabDoc.Put(area);
	
EndProcedure

Procedure putFooterAttachment(Params, Env, Table)
	
	area = Env.Attachment.GetArea("Footer");
	p = area.Parameters;
	p.Amount = Table.Total("Amount");
	p.Total = Table.Total("Total");
	p.VAT = Table.Total("VAT");
	p.Weight = Table.Total("Weight");
	tabDoc = Params.TabDoc;
	tabDoc.Put(area);
	tabDoc.PutHorizontalPageBreak();
	
EndProcedure

Procedure putBack(Params, Env)
	
	if (not Env.Fields.PrintBack) then
		return;
	endif;
	area = Env.Back.GetArea("Header");
	Params.TabDoc.Put(area);
	
EndProcedure

#endregion

#endif
